БухЭксп/Catalogs/CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбменГИСЭПДНастройкиЗаполненияЭПД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокументаЭПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТитул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АлгоритмЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбменГИСЭПДНастройкиЗаполненияЭПД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбласти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/ТипыЭлементовРегламентаЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовРегламентаЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВложениеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДО_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПОА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПОА_УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУКДДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУКДПокупателяДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУПДДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУПДПокупателяДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДополнительныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДОПУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнформацияПокупателяУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнформацияПокупателяУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИПЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКСЧФДИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКСЧФУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПДОЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПДПЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПервичныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСЧФДОПУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСЧФУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУУЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_ОткФщ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_ОткФщ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_ОткМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул2_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул2_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул3_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул3_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткГО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткТ3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул3_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул5_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ОтказВПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ДополнительнаяИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ОтзывЧерновика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ОтправленДокументПоЧерновику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЭР_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСР_Титул1</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбменГИСЭПДНастройкиЗаполненияЭПД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	CW_ОбменГИСЭПДДополнительный.УстановитьПараметрыТиповДокументовЭПД(ЭтотОбъект);
	
	Если ТипЗнч(ДоступныеТипыДокументовЭПД) = Тип("ФиксированныйМассив") 
		И Параметры.Ключ.Пустая() 
		и ДоступныеТипыДокументовЭПД.Количество() = 1 Тогда
		Объект.ТипДокументаЭПД = ДоступныеТипыДокументовЭПД[0];
	КонецЕсли;   
	
	Если Не Объект.ТипДокументаЭПД.Пустая() Тогда
		ТипДокументаЭПДПриИзмененииНаСервере();  
	КонецЕсли;  
	
	CW_ОбменГИСЭПДДополнительный.ЗаполнитьДоступныеТипыОбъектов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	CW_ОбменГИСЭПДДополнительный.УстановитьПараметрыТиповДокументовЭПД(ЭтотОбъект);
	
	ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	ПрефиксТитула = ИнформацияПоПрефиксамТитула.ВПрограмме;  
	
	ТекущийТитулПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьНастройкиЗаполненияЭПД();

КонецПроцедуры   

&НаСервере
Процедура ЗаписатьНастройкиЗаполненияЭПД()  
	
	ПоляТаблицПоТитулам = CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьСоставПолейТаблиц();

	Набор = РегистрыСведений.CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.СоздатьНаборЗаписей();
	Набор.Отбор.НастройкаЗаполнения.Установить(Объект.Ссылка);
	Набор.Очистить();
	
	ПоляТаблиц = ПоляТаблицПоТитулам.Получить(Объект.ТекущийТитул);
	
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		Если СтрНачинаетсяС(Область.Имя, "МногострочнаяЧасть") Тогда
			Продолжить;
		КонецЕсли; 
		
		ИмяТабличнойЧасти = ПоляТаблиц.Получить(Область.Имя);
		
		Запись = Набор.Добавить();
		Запись.НастройкаЗаполнения	= Объект.Ссылка;
		Запись.ИмяТабличнойЧасти 	= ИмяТабличнойЧасти;
		Запись.ИмяОбласти 			= Область.Имя;
		Запись.АлгоритмЗаполнения	= Область.Значение;
		
	КонецЦикла;   
	
	Набор.Записать(Истина);

КонецПроцедуры    



&НаКлиенте
Процедура ТипДокументаЭПДПриИзменении(Элемент)
	
	ТипДокументаЭПДПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипДокументаЭПДПриИзмененииНаСервере()

	CW_ОбменГИСЭПДДополнительный.УстановитьСписокВыбораТитула(ЭтотОбъект);

КонецПроцедуры


&НаКлиенте
Процедура ТекущийТитулПриИзменении(Элемент)
	ТекущийТитулПриИзмененииНаСервере(); 
	ЗаполнитьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекущийТитулПриИзмененииНаСервере()
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	Если ТипЗнч(ПараметрыДокументаЭПД) = Тип("ФиксированнаяСтруктура") тогда 
		
		ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
		ПрефиксТитула = ИнформацияПоПрефиксамТитула.ВПрограмме;
		
		Макет = ПолучитьМакетОбъекта();
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Макет);  
		
		ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);  
		
		ЗаполнитьМакетИзНастроек();                                                     
		
		Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1") Тогда 
			ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность");   
			Если ОбластьДоверенность <> Неопределено Тогда
				ТабличныйДокумент.УдалитьОбласть(ОбластьДоверенность, ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли; 
			
			Для каждого Область из ТабличныйДокумент.Области Цикл
				Если СтрНачинаетсяС(Область.Имя, "УдалитьСтроку") Тогда
					Область.Гиперссылка = Ложь;
					Область.Текст = "";  
				КонецЕсли; 
			КонецЦикла;     
		КонецЕсли;  
		
	КонецЕсли;  
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьМакетИзНастроек()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.НастройкаЗаполнения КАК НастройкаЗаполнения,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.ИмяОбласти КАК ИмяОбласти,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.АлгоритмЗаполнения КАК АлгоритмЗаполнения
	|ИЗ
	|	РегистрСведений.CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД КАК CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД
	|ГДЕ
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.НастройкаЗаполнения = &НастройкаЗаполнения";
	
	Запрос.УстановитьПараметр("НастройкаЗаполнения", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьТабличногоДокумента = ТабличныйДокумент.Области.Найти(Выборка.ИмяОбласти);
		Если ОбластьТабличногоДокумента <> Неопределено Тогда
			ОбластьТабличногоДокумента.Значение = Выборка.АлгоритмЗаполнения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьМакетОбъекта()
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	ИмяМакета 	= ПараметрыДокументаЭПД["Настройки"].Получить(Объект.ТекущийТитул); 
	Макет 		= Справочники.CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ПолучитьМакет(ИмяМакета);

	Возврат Макет;
	
КонецФункции


&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)

	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Модифицированность = истина;
КонецПроцедуры

&НаСервере
Процедура ПоказатьУровеньГруппировокСтрокНаСервере(Индекс)
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(Индекс);  
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент) 
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		ЗаполнитьНаименованиеНаСервере();              
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура СоздатьАлгоритмыЗаполненияРеквизитов(Команда)  
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран тип объекта!",,"ТипОбъекта", "Объект", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ТекущийТитул) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран титул!",,"ТекущийТитул", "Объект", Отказ);
	КонецЕсли;   
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;   
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Для каждого незаполненного реквизита титула будет найден, а в случае отсутствия будет создан новый алгоритм заполнения. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	РезультатВыполнения =  ПродолжитьЗаполнениеСправочникАлгоритмыНаСервереВФоне(); 
	Если РезультатВыполнения = Неопределено Тогда 
		ПоказатьПредупреждение(, "Не удалось определить имя макета настроек для титула!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатВыполнения", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 	

КонецПроцедуры

&НаСервере 
Функция ПродолжитьЗаполнениеСправочникАлгоритмыНаСервереВФоне()  
	
	СоответствиеОбластей = Новый Соответствие;  
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1, 	"ЭЗЗ_Титул1");
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2, 	"ЭЗЗ_Титул2");  
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1, 	"ЭТрН_Титул1"); 
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1, 	"ЭПЛ_Титул1");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2, 	"ЭПЛ_Титул2");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3, 	"ЭПЛ_Титул3");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4, 	"ЭПЛ_Титул4");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5, 	"ЭПЛ_Титул5"); 
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1, "ЭСВ_Титул1_1");   

	ИмяОбласти = СоответствиеОбластей.Получить(Объект.ТекущийТитул);
	Если ИмяОбласти = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   

	ПараметрыПроцедуры = Новый Структура;  
	ПараметрыПроцедуры.Вставить("ТипДокументаЭПД", 	Объект.ТипДокументаЭПД);  
	ПараметрыПроцедуры.Вставить("ТекущийТитул", 	Объект.ТекущийТитул);  
	ПараметрыПроцедуры.Вставить("ТипОбъекта", 		Объект.ТипОбъекта);  
	ПараметрыПроцедуры.Вставить("ИмяОбласти", 		ИмяОбласти);  
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбменГИСЭПДДополнительный.СформироватьАлгоритмыЗаполненияРеквизитовЭПД",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции     

&НаКлиенте 
Процедура ОбработатьРезультатВыполнения(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		//Выполннение прервано
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
        ОбработатьРезультатВыполненияНаСервере(РезультатВыполнения.АдресРезультата);
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения справочника!");  
		
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьРезультатВыполненияНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого КлючЗначение из Результат Цикл
		НайденнаяОбласть = ТабличныйДокумент.Области.Найти(КлючЗначение.Ключ);
		Если НайденнаяОбласть <> Неопределено Тогда
			НайденнаяОбласть.Значение = КлючЗначение.Значение;    
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование(Команда)
	ЗаполнитьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованиеНаСервере()
	
	ШаблонНаименования  = "%1 (%2, %3)";
	
	Объект.Наименование  = СтрШаблон(ШаблонНаименования, 
		СокрЛП(Объект.ТипОбъекта.Синоним),
		СокрЛП(Объект.ТипДокументаЭПД),
		СокрЛП(Объект.ТекущийТитул));
	
КонецПроцедуры
